engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
            uint16_t raw = 0;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_get_oneshot(nullptr, ADC_CHANNEL_0, &raw));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_get_oneshot(ADC1, ADC_CHANNEL_0, nullptr));

            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_get_oneshot(ADC1, ADC_CHANNEL_0, &raw));
            TEST_ASSERT_TRUE(raw <= 0x0FFFU);
        }

        void internal_channel_readings_complete_and_manage_their_own_enables() {
            reset_to_baseline();

            uint16_t raw = 0;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_v_bat(nullptr, &raw));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_v_bat(ADC1, &raw));
            TEST_ASSERT_TRUE(raw <= (0x0FFFU * VBAT_DIVIDER_RATIO));
            // VBATE must be switched back off once the reading is done
            TEST_ASSERT_FALSE(ADC->CCR & ADC_CCR_VBATE);

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_temperature(nullptr, &raw));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_temperature(ADC1, &raw));
            TEST_ASSERT_TRUE(raw <= 0x0FFFU);
            // The temperature sensor/VREFINT stay latched on afterwards - they share the TSVREFE bit
            TEST_ASSERT_TRUE(ADC->CCR & ADC_CCR_TSVREFE);

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_v_ref_internal(nullptr, &raw));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_v_ref_internal(ADC1, &raw));
            TEST_ASSERT_TRUE(raw <= 0x0FFFU);

            adc_power_on_temp_sensor(false);
        }

        void voltage_and_temperature_math_are_internally_consistent() {
            reset_to_baseline();

            float vdda = 0.0F;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_vdda(nullptr, &vdda));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_vdda(ADC1, nullptr));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_vdda(ADC1, &vdda));
            // VDDA on this board is a regulated supply - sanity-bound it rather than assert an exact value
            TEST_ASSERT_TRUE(vdda > 1.5F && vdda < 4.0F);

            float temp_c = 0.0F;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_temp_celsius(nullptr, &temp_c));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_temp_celsius(ADC1, nullptr));
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_temp_celsius(ADC1, &temp_c));
            // Plausible bench/board temperature bound, not a calibrated accuracy check
            TEST_ASSERT_TRUE(temp_c > -40.0F && temp_c < 125.0F);

            // adc_get_value_right_aligned is NOT pure math: it calls adc_get_vdda(...) internally,
            // which triggers a fresh VREFINT conversion every time. Re-measure vdda immediately
            // before comparing so we're not racing a stale reading.
            struct case_t {
                adc_resolution_t resolution;
                uint16_t         raw;
                uint32_t         full_scale;
            };
            constexpr std::array<case_t, 4> CASES = {{
                {.resolution = ADC_RES_6_BITS, .raw = 63, .full_scale = 64},
                {.resolution = ADC_RES_8_BITS, .raw = 255, .full_scale = 256},
                {.resolution = ADC_RES_10_BITS, .raw = 1023, .full_scale = 1024},
                {.resolution = ADC_RES_12_BITS, .raw = 4095, .full_scale = 4096},
            }};

            float measured_vdda = 0.0F;
            TEST_ASSERT_EQUAL(HAL_OK, adc_get_vdda(ADC1, &measured_vdda));

            for (const auto& cases : CASES) {
                float voltage = 0.0F;
                TEST_ASSERT_EQUAL(HAL_OK, adc_get_value_right_aligned(ADC1, cases.raw, cases.resolution, &voltage));
                const float expected = (measured_vdda * static_cast<float>(cases.raw)) / static_cast<float>(cases.full_scale);
                TEST_ASSERT_FLOAT_WITHIN(0.01F, expected, voltage);
            }

            float aligned = 0;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_value_right_aligned(nullptr, 100, ADC_RES_12_BITS, &aligned));
        }

        void value_right_aligned_rejects_unknown_resolution() {
            reset_to_baseline();

            float          voltage          = 0.0F;
            constexpr auto bogus_resolution = static_cast<adc_resolution_t>(0xFF);
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_value_right_aligned(ADC1, 100, bogus_resolution, &voltage));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_get_value_right_aligned(ADC1, 100, ADC_RES_12_BITS, nullptr));
        }

        void regular_group_channel_sequence_registers_are_placed_correctly() {
            reset_to_baseline();

            // Exercises the SQR3/SQR2 boundary at 6/7 channels, the SQR2/SQR1 boundary at
            // 12/13 channels, and both extremes (1 and the maximum of 16)
            constexpr std::array<size_t, 6> COUNTS{1, 6, 7, 12, 13, MAX_REGULAR_CHANNELS};

            for (const auto count : COUNTS) {
                std::array<adc_channels_t, MAX_REGULAR_CHANNELS> sequence{};
                for (size_t i = 0; i < count; i++) {
                    sequence[i] = static_cast<adc_channels_t>(i % 16);
                }

                uint16_t                      buffer = 0;
                const adc_continuous_config_t config{
                    .channels         = {.sequence = sequence.data(), .num_of_channels = count},
                    .trigger          = RG_TRIGGER_SOFTWARE,
                    .trigger_polarity = ADC_TRIGGER_RISING_EDGE,
                    .buffer_1         = &buffer,
                    .buffer_2         = nullptr,
                    .buffer_size      = 1,
                    .priority         = DMA_PRIORITY_LOW,
                    .circular_mode    = DMA_MODE_ONESHOT,
                    .callbacks        = {},
                };

                TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_start_conv(ADC1, &config));

                constexpr uint32_t BIT_WIDTH = 5;
                constexpr uint32_t MASK      = (1U << BIT_WIDTH) - 1U;

