engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
                for (size_t i = 0; i < count; i++) {
                    const uint32_t expected = std::to_underlying(sequence[i]) & MASK;
                    uint32_t       actual   = 0;
                    if (i >= 12) {
                        actual = (ADC1->SQR1 >> ((i - 12) * BIT_WIDTH)) & MASK;
                    } else if (i >= 6) {
                        actual = (ADC1->SQR2 >> ((i - 6) * BIT_WIDTH)) & MASK;
                    } else {
                        actual = (ADC1->SQR3 >> (i * BIT_WIDTH)) & MASK;
                    }
                    TEST_ASSERT_EQUAL_UINT32(expected, actual);
                }

                TEST_ASSERT_EQUAL_UINT32(count - 1, (ADC1->SQR1 & ADC_SQR1_L) >> ADC_SQR1_L_Pos);
                TEST_ASSERT_EQUAL(count > 1, (ADC1->CR1 & ADC_CR1_SCAN) != 0);

                TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_end_conv(ADC1));
            }

            reset_to_baseline();
        }

        void continuous_conversion_arg_guards() {
            reset_to_baseline();

            constexpr adc_channels_t channel = ADC_CHANNEL_0;
            std::array<uint16_t, 4>  buffer  = {};

            const adc_continuous_config_t base = {
                .channels         = {.sequence = &channel, .num_of_channels = 1},
                .trigger          = RG_TRIGGER_SOFTWARE,
                .trigger_polarity = ADC_TRIGGER_RISING_EDGE,
                .buffer_1         = buffer.data(),
                .buffer_2         = nullptr,
                .buffer_size      = buffer.size(),
                .priority         = DMA_PRIORITY_LOW,
                .circular_mode    = DMA_MODE_ONESHOT,
                .callbacks        = {},
            };

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(nullptr, &base));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(ADC1, nullptr));

            auto no_channels     = base;
            no_channels.channels = {.sequence = nullptr, .num_of_channels = 1};
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(ADC1, &no_channels));

            auto zero_count     = base;
            zero_count.channels = {.sequence = &channel, .num_of_channels = 0};
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(ADC1, &zero_count));

            auto too_many                     = base;
            too_many.channels.num_of_channels = MAX_REGULAR_CHANNELS + 1;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(ADC1, &too_many));

            auto no_buffer     = base;
            no_buffer.buffer_1 = nullptr;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(ADC1, &no_buffer));

            auto missing_second_buffer          = base;
            missing_second_buffer.circular_mode = DMA_MODE_DOUBLE_BUFFER;
            missing_second_buffer.buffer_2      = nullptr;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_regular_group_cont_start_conv(ADC1, &missing_second_buffer));
        }

        void continuous_conversion_fills_the_buffer_via_dma_and_calls_back() {
            reset_to_baseline();

            constexpr auto          CHANNELS = std::array{ADC_CHANNEL_0, ADC_CHANNEL_1};
            std::array<uint16_t, 8> buffer{};
            buffer.fill(0xFFFF);

            s_cont_done = false;

            const adc_continuous_config_t config = {
                .channels         = {.sequence = CHANNELS.data(), .num_of_channels = CHANNELS.size()},
                .trigger          = RG_TRIGGER_SOFTWARE,
                .trigger_polarity = ADC_TRIGGER_RISING_EDGE,
                .buffer_1         = buffer.data(),
                .buffer_2         = nullptr,
                .buffer_size      = static_cast<uint16_t>(buffer.size()),
                .priority         = DMA_PRIORITY_LOW,
                .circular_mode    = DMA_MODE_ONESHOT,
                .callbacks =
                    {
                        .on_buffer_full       = cont_done_cb,
                        .on_transfer_error    = nullptr,
                        .on_direct_mode_error = nullptr,
                        .on_data_overrun      = nullptr,
                        .user                 = nullptr,
                    },
            };

            adc_enable_nvic_irq(true);
            TEST_ASSERT_EQUAL(HAL_OK, adc_regular_group_cont_start_conv(ADC1, &config));

            TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                         return s_cont_done;
                                     }),
                                     "Continuous DMA conversion never completed");

            for (const auto sample : buffer) {
                TEST_ASSERT_TRUE(sample <= 0x0FFFU);
            }

            adc_enable_nvic_irq(false);
            reset_to_baseline();
        }

        void injected_group_covers_every_channel_count_and_offset_slot() {
            reset_to_baseline();

            constexpr std::array<size_t, 4> COUNTS{1, 2, 3, 4};

            for (const auto count : COUNTS) {
                std::array<adc_channels_t, MAX_INJECTED_CHANNELS> channels{};
                for (size_t i = 0; i < count; i++) {
                    channels[i] = static_cast<adc_channels_t>(i);
                }

                adc_injected_group_config_t config{};
                config.channels         = {.sequence = channels.data(), .num_of_channels = count};
                config.trigger          = JG_TRIGGER_SOFTWARE;
                config.trigger_polarity = ADC_TRIGGER_RISING_EDGE;
                for (size_t i = 0; i < count; i++) {
                    config.offsets[i] = static_cast<uint16_t>(10 * (i + 1));
                }
                config.on_conv_complete = nullptr;
                config.arg              = nullptr;

                TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_start_conv(ADC1, &config));

                TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                             return (ADC1->SR & ADC_SR_JEOC) != 0;
                                         }),
                                         "Injected conversion never finished");

                std::array<uint16_t, MAX_INJECTED_CHANNELS> results{};
                TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_get_result(ADC1, results.data(), count));
                for (size_t i = 0; i < count; i++) {
                    LOGI(TAG, "Sample %zu: %u", i, results[i]);
                    TEST_ASSERT_TRUE(results[i] <= 0xFFFU);
                }

                ADC1->SR &= ~ADC_SR_JEOC;
            }

            reset_to_baseline();
        }

        void injected_group_result_before_completion_is_not_done() {
            reset_to_baseline();
            ADC1->SR &= ~ADC_SR_JEOC;

            uint16_t result = 0;
            TEST_ASSERT_EQUAL(HAL_ERR_NOT_DONE, adc_injected_group_get_result(ADC1, &result, 1));
        }

        void injected_group_arg_guards() {
            reset_to_baseline();

            constexpr auto              channels = std::array{ADC_CHANNEL_0};
            adc_injected_group_config_t config{};
            config.channels = {.sequence = channels.data(), .num_of_channels = channels.size()};
            config.trigger  = JG_TRIGGER_SOFTWARE;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_start_conv(nullptr, &config));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_start_conv(ADC1, nullptr));

            auto no_channels     = config;
            no_channels.channels = {.sequence = nullptr, .num_of_channels = 1};
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_start_conv(ADC1, &no_channels));

