engineer-ae3o/stm32-hal-library/components/test/src/adc.cpp
            auto too_many                     = config;
            too_many.channels.num_of_channels = MAX_INJECTED_CHANNELS + 1;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_start_conv(ADC1, &too_many));

            std::array<uint16_t, 1> result{};
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_get_result(ADC1, nullptr, 1));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_get_result(ADC1, result.data(), 0));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_injected_group_get_result(ADC1, result.data(), MAX_INJECTED_CHANNELS + 1));
        }

        void injected_group_invokes_the_completion_callback_via_the_isr() {
            reset_to_baseline();

            constexpr auto              channels = std::array{ADC_CHANNEL_0};
            adc_injected_group_config_t config{};
            config.channels         = {.sequence = channels.data(), .num_of_channels = channels.size()};
            config.trigger          = JG_TRIGGER_SOFTWARE;
            config.trigger_polarity = ADC_TRIGGER_RISING_EDGE;
            config.on_conv_complete = injected_done_cb;
            config.arg              = nullptr;

            s_injected_done = false;
            adc_enable_nvic_irq(true);

            TEST_ASSERT_EQUAL(HAL_OK, adc_injected_group_start_conv(ADC1, &config));
            TEST_ASSERT_TRUE_MESSAGE(wait_until([]() {
                                         return s_injected_done;
                                     }),
                                     "Injected-group completion callback never fired");

            // The isr helper must have cleared both the flag and the interrupt enable behind us
            TEST_ASSERT_FALSE(ADC1->SR & ADC_SR_JEOC);
            TEST_ASSERT_FALSE(ADC1->CR1 & ADC_CR1_JEOCIE);

            adc_enable_nvic_irq(false);
            reset_to_baseline();
        }

        void analog_watchdog_validates_thresholds_and_monitor_flags() {
            reset_to_baseline();

            adc_analog_wdg_config_t config{};
            config.min_adc_value            = 100;
            config.max_adc_value            = 50; // inverted on purpose
            config.on_thresholds_violated   = wdg_cb;
            config.monitor_regular_channels = true;

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, &config));

            config.min_adc_value = 50;
            config.max_adc_value = 100;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(nullptr, &config));
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, nullptr));

            auto no_callback                   = config;
            no_callback.on_thresholds_violated = nullptr;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, &no_callback));

            auto no_monitor_target                      = config;
            no_monitor_target.monitor_regular_channels  = false;
            no_monitor_target.monitor_injected_channels = false;
            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_start(ADC1, &no_monitor_target));

            struct combo_t {
                bool     regular;
                bool     injected;
                uint32_t expected_bits;
            };
            constexpr std::array<combo_t, 3> COMBOS{{
                {.regular = true, .injected = true, .expected_bits = ADC_CR1_AWDEN | ADC_CR1_JAWDEN},
                {.regular = false, .injected = true, .expected_bits = ADC_CR1_JAWDEN},
                {.regular = true, .injected = false, .expected_bits = ADC_CR1_AWDEN},
            }};

            for (const auto& combo : COMBOS) {
                auto c                      = config;
                c.monitor_regular_channels  = combo.regular;
                c.monitor_injected_channels = combo.injected;
                c.min_adc_value             = 0x1234; // deliberately > 12 bits to verify masking
                c.max_adc_value             = 0xFFFF;

                TEST_ASSERT_EQUAL(HAL_OK, adc_analog_wdg_start(ADC1, &c));
                TEST_ASSERT_EQUAL_UINT32(combo.expected_bits, ADC1->CR1 & (ADC_CR1_AWDEN | ADC_CR1_JAWDEN));
                TEST_ASSERT_TRUE(ADC1->CR1 & ADC_CR1_AWDIE);
                TEST_ASSERT_EQUAL_UINT32(c.max_adc_value & 0xFFFU, ADC1->HTR);
                TEST_ASSERT_EQUAL_UINT32(c.min_adc_value & 0xFFFU, ADC1->LTR);

                TEST_ASSERT_EQUAL(HAL_OK, adc_analog_wdg_stop(ADC1));
                TEST_ASSERT_EQUAL_UINT32(0, ADC1->CR1 & (ADC_CR1_AWDEN | ADC_CR1_JAWDEN | ADC_CR1_AWDIE));
            }

            TEST_ASSERT_EQUAL(HAL_ERR_INVALID_ARG, adc_analog_wdg_stop(nullptr));

            reset_to_baseline();
        }

    } // namespace

    void all() {
        LOGI(TAG, "Starting the tests on the ADC driver");
        UNITY_BEGIN();

        RUN_TEST(clk_enable_rejects_unknown_handles);
        RUN_TEST(power_on_toggles_adon);
        RUN_TEST(configure_covers_every_alignment_resolution_and_sample_time);
        RUN_TEST(deconfigure_powers_down_and_clears_state);
        RUN_TEST(clk_configure_sweeps_every_prescaler);
        RUN_TEST(nvic_irq_enable_toggles_the_adc_line);
        RUN_TEST(temp_sensor_power_toggles_tsvrefe);
        RUN_TEST(oneshot_regular_group_completes_within_12_bit_range);
        RUN_TEST(internal_channel_readings_complete_and_manage_their_own_enables);
        RUN_TEST(voltage_and_temperature_math_are_internally_consistent);
        RUN_TEST(value_right_aligned_rejects_unknown_resolution);
        RUN_TEST(regular_group_channel_sequence_registers_are_placed_correctly);
        RUN_TEST(continuous_conversion_arg_guards);
        RUN_TEST(continuous_conversion_fills_the_buffer_via_dma_and_calls_back);
        RUN_TEST(injected_group_covers_every_channel_count_and_offset_slot);
        RUN_TEST(injected_group_result_before_completion_is_not_done);
        RUN_TEST(injected_group_arg_guards);
        RUN_TEST(injected_group_invokes_the_completion_callback_via_the_isr);
        RUN_TEST(analog_watchdog_validates_thresholds_and_monitor_flags);

        UNITY_END();
        LOGI(TAG, "Done with all tests on the ADC driver");
    }

} // namespace test::adc
